%%% -*- coding: utf-8 -*-
%%% Copyright (C) 2014 Alex Kazinskiy
%%%
%%% This file is part of Combats Battle Manager
%%%
%%% Author contact: alboo@list.ru

%%% ====================================================================
%%% Обречённость
%%% От вашего следующего удар невозможно увернуться или парировать
%%% ====================================================================


-module(multi_doom).
-behaviour(gen_buff).
-include_lib("bme.hrl").

%% ====================================================================
%% API functions
%% ====================================================================
-export([new/1]).


new(Buff) ->
	{ok, Buff#buff{
			id   = multi_doom,
			name = <<"Обречённость"/utf8>>,
			type = trick,
			time = infinity,
			charges = 1,
			value = [{'mfs.audodge', 100}]
		}}.

%% ====================================================================
%% Internal functions
%% ====================================================================
