%%% -*- coding: utf-8 -*-
%%% Copyright (C) 2014 Alex Kazinskiy
%%%
%%% This file is part of Combats Battle Manager
%%%
%%% Author contact: alboo@list.ru

%%% ====================================================================
%%% Математические функции
%%% ====================================================================

-module(math).

%% ====================================================================
%% API functions
%% ====================================================================
-export([precision/2]).

%% precision/2
%% ====================================================================
%% ограничение точности floating-point
precision(Float, 0) ->
	trunc(Float);

precision(Float, 1) ->
	(trunc(Float * 10)) / 10;

precision(Float, 2) ->
	(trunc(Float * 100)) / 100.

%% ====================================================================
%% Internal functions
%% ====================================================================


